In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [3]:
games = pd.read_csv('../Data/vgsales_new.csv')
games.head(2)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,NA_Total,EU_Sales,EU_Total,JP_Sales,JP_Total,Other_Sales,Other_Total,Global_Sales,Global_Total,Mods
0,259,Asteroids,2600,1980.0,Shooter,Atari,4.00,4000000,0.26,260000,0.0,0,0.05,50000,4.31,4310000,"1,000,000"
1,545,Missile Command,2600,1980.0,Shooter,Atari,2.56,2560000,0.17,170000,0.0,0,0.03,30000,2.76,2760000,NaN

In [6]:
games = games.drop(columns= 'Mods')

In [7]:
games.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16598 entries, 0 to 16597
Data columns (total 16 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Rank          16598 non-null  int64
 1   Name          16598 non-null  object
 2   Platform      16598 non-null  object
 3   Year          16327 non-null  float64
 4   Genre         16598 non-null  object
 5   Publisher     16540 non-null  object
 6   NA_Sales      16598 non-null  float64
 7   NA_Total      16598 non-null  int64
 8   EU_Sales      16598 non-null  float64
 9   EU_Total      16598 non-null  int64
 10  JP_Sales      16598 non-null  float64
 11  JP_Total      16598 non-null  int64
 12  Other_Sales   16598 non-null  float64
 13  Other_Total   16598 non-null  int64
 14  Global_Sales  16598 non-null  float64
 15  Global_Total  16598 non-null  int64
dtypes: float64(6), int64(6), object(4)
memory usage: 2.0+ MB

In [11]:
games['Year'].value_counts(dropna=False)

Year
2009.0    1431
2008.0    1428
2010.0    1259
2007.0    1202
2011.0    1139
2006.0    1008
2005.0     941
2002.0     829
2003.0     775
2004.0     763
2012.0     657
2015.0     614
2014.0     582
2013.0     546
2001.0     482
1998.0     379
2000.0     349
2016.0     344
1999.0     338
1997.0     289
NaN        271
1996.0     263
1995.0     219
1994.0     121
1993.0      60
1981.0      46
1992.0      43
1991.0      41
1982.0      36
1986.0      21
1983.0      17
1989.0      17
1990.0      16
1987.0      16
1988.0      15
1984.0      14
1985.0      14
1980.0       9
2017.0       3
2020.0       1
Name: count, dtype: int64

In [12]:
games['Decade'] = (games['Year'] // 10) * 10

In [14]:
games.head()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,NA_Total,EU_Sales,EU_Total,JP_Sales,JP_Total,Other_Sales,Other_Total,Global_Sales,Global_Total,Decade
0,259,Asteroids,2600,1980.0,Shooter,Atari,4.00,4000000,0.26,260000,0.0,0,0.05,50000,4.31,4310000,1980.0
1,545,Missile Command,2600,1980.0,Shooter,Atari,2.56,2560000,0.17,170000,0.0,0,0.03,30000,2.76,2760000,1980.0
2,1768,Kaboom!,2600,1980.0,Misc,Activision,1.07,1070000,0.07,70000,0.0,0,0.01,10000,1.15,1150000,1980.0
3,1971,Defender,2600,1980.0,Misc,Atari,0.99,990000,0.05,50000,0.0,0,0.01,10000,1.05,1050000,1980.0
4,2671,Boxing,2600,1980.0,Fighting,Activision,0.72,720000,0.04,40000,0.0,0,0.01,10000,0.77,770000,1980.0

In [15]:
games['Decade'].value_counts()

Decade
2000.0    9208
2010.0    5144
1990.0    1769
1980.0     205
2020.0       1
Name: count, dtype: int64